# Brewfile.pentest — Security / pentest / CTF tooling.
#
# This file is NOT installed by `make bootstrap`. Install on demand with:
#   brew bundle --file=Brewfile.pentest
# Or check status without installing:
#   brew bundle check --file=Brewfile.pentest

# --- Network discovery / port scanning -------------------------------------
brew "nmap"          # de-facto standard scanner
brew "rustscan"      # fast Rust wrapper that hands service detection to nmap
brew "masscan"       # async ultra-fast scanner

# --- Subdomain / asset enumeration -----------------------------------------
# These collectively replace the legacy `knock` (no longer maintained).
brew "subfinder"     # ProjectDiscovery, passive subdomain enum
brew "amass"         # OWASP, passive + active enum
brew "assetfinder"   # tomnomnom, simple passive enum

# --- Web app ---------------------------------------------------------------
brew "sqlmap"        # SQL injection automation

# --- Password / hash cracking ----------------------------------------------
brew "hashcat"       # GPU-accelerated; replaces `john` for most workflows
brew "john"          # John the Ripper, keep for formats hashcat doesn't cover
brew "hydra"         # network login bruteforcer
brew "ncrack"        # alternative to hydra (better SSH/RDP)

# --- DNS tunneling ---------------------------------------------------------
brew "iodine"        # replaces legacy `dns2tcp`

# --- Forensics / file carving / firmware -----------------------------------
brew "binwalk"       # firmware analysis; replaces `foremost` for embedded data

# --- Packet capture / replay -----------------------------------------------
brew "tcpreplay"     # pcap replay (still the standard)

# --- WiFi ------------------------------------------------------------------
# NOTE: macOS' built-in NIC can't enter monitor mode without third-party
# drivers, so aircrack-ng is mostly limited to offline pcap analysis here.
# Real WiFi pentesting still wants Linux + a USB adapter.
brew "aircrack-ng"

# --- Intentionally omitted -------------------------------------------------
# Tools previously in the main Brewfile that are no longer recommended:
#   cifer       — classic-cipher solver, fossilized; use CyberChef
#   dns2tcp     — superseded by iodine (above)
#   fcrackzip   — superseded by hashcat/john + zip2john
#   foremost    — superseded by binwalk / scalpel
#   hashpump    — upstream-abandoned; build hash_extender from source if needed
#   knock       — superseded by subfinder/amass/assetfinder (above)
#   tcpflow     — use `tshark` (Wireshark CLI) instead
#   tcptrace    — use `tshark` / `zeek` instead
