tap "amoswzw/tap", "git@github.com:amoswzw/homebrew-tap.git"
tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "mhaeuser/mhaeuser"
brew "autojump"
brew "bat"
brew "btop"
brew "cloc"
brew "colima"
brew "docker"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "htop"
brew "lazygit"
brew "mole"
brew "tree-sitter"
brew "neovim"
brew "neovim-remote"
brew "nowplaying-cli"
brew "ripgrep"
brew "opencode"
brew "osv-scanner"
brew "pandoc"
brew "pinentry-mac"
brew "pyenv"
brew "ruby"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "tree-sitter-cli"
brew "watch"
brew "wget"
brew "xcodegen"
brew "zsh"
brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"
brew "felixkratz/formulae/borders"
cask "1password-cli"
cask "alacritty"
cask "basictex"
cask "brave-browser"
cask "clash-verge-rev"
cask "claude"
cask "amoswzw/tap/fluxtty"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "google-chrome"
cask "amoswzw/tap/hushloom"
cask "kap"
cask "keycastr"
cask "squirrel-app"
cask "stats"
cask "amoswzw/tap/stayawake"
cask "visual-studio-code"
go "golang.org/x/vuln/cmd/govulncheck"
cargo "aswitch-cli"
cargo "cargo-audit"
cargo "tauri-cli"
